BankXml/MT102_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns4:getMt102Request xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>aBzMnBVR/hyv0LG+sCY/TazRn8xNd4FtF+V5CqLO/Paq/V1sFWFK5CG5hqfYBZlkVVTvOi4qOaFu&#13;
DXFZGaQvyY7XHjXtX+Ns/LPxAUupQkHE7Vw0KaV75UKeu20r8/GGf6nC+SfR+u3pWLAT7kiHTmfY&#13;
TlsijtBBe1bCrf1gtn6cBzFFuGu6iwTJZAQ/U2QheIvMyZHVZYEiUXpHJWTZ0kX6YEkfjvmIQ7y1&#13;
2OHnROhhosEbb+pPgOfRUIL46na8jlxL7eGl3+x1xQYc3inHmFo68w8OP4dmRLJGHiXapwamun0Y&#13;
WjxWWZJP+g3BDUYcsBvr+sCl2qK4/6lsE7o0pg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>EozhJ8cTxe3PdPcZHOpRVwaDBddTPB1nmT7Q+sgjGcz5949sqdXW94PGKVgfzF810fzN5i2uJDe/&#13;
Lx7C6YJw95zDvBkmQIrC32V+ThS/nQaNADaIjouyGvsZVO0VyENYsa+ESYWDkhiY8Ms15hl+o7Ur&#13;
I+SBX4z5DSQZ5HNkCSEi79xm9eYbCHpE2GuVDrBO0gZz2VA5sMsSCzk+n12dGujr7ruFqyl175zv&#13;
sb8k7frdLxa4DjXNJTIUSmD8L3ly2bR5/RMfiw6CW1b5o30koV2w7A7eI0fxFQvxpfROygPXDL+N&#13;
mHhZ0l5IF0mdf8jJVN2IVxg6SDdgleh5JQab2jH8hw4mISIGiY7XQ9YBDlKHGBPWH7vfazYNE0h1&#13;
jX8QyCDFmcxFSb83hNQAowEYY2/djiHNEdyCukpLLHY4Uuci8I8umVZ9gAqHTezXKrLKiby+oTtf&#13;
ErsglkHPexQsSsYhlkDGzVsQ4zZHcFtSXpoE5S2NW3KGABNSRaYn9nT8fcevKQf6gPOthq7mb+p/&#13;
k3z6cDFODpRT0K2hKqdaG9wpZGWPKQOBnP942KsGej37hy941X4g6PcGgcF0ZzuIjcipfOoGYlKC&#13;
MffaKrMuIkEuuVaWde3eSXci/+CvaxoLgJQcvt9SO0dFUmzzIItpLASDRh3U27rW0gh9pa2i8ju7&#13;
Sbo2AHTx1N02EbTGTbEyeoJOlCEjCHCD+mU4ERwYYgzi4E3SS80KtWqt6QcHtgj17hgbdQghU52l&#13;
M/Fh8+M001O0oEhzF4qSpIqLNIiHDc7+Ar6w1nWWdZrh1EGazlnbZw7PHziyySVcE5zmnhjeDgiL&#13;
JFZ9bjzNqZZNOVezN6mquEP9jcfHOnG4MmTKvbd9QXqyEXvrF77HUtXpMBG230p+EqanrZ6nE7QB&#13;
MgUTxIDW+7s9jct3p6m6ZhF61o3g+o2rF6w2C9AhRwv7CpyvxaQeL1iSdhh2DAPrQQTH4CY6gOJ4&#13;
0jaBnJiqOhcEWjKmL+kae65/LyUFTPsaQPdttyWfBqa9hkH2kJCONKzo/sWcI/mXmtcqRM3roBx4&#13;
5AGhJcvBmIyDw0Axglp3iSi+FQsJk/CY71BFf2yoWosrZRROVGe3hdtHgWE2zWUmHtoexuaIW9iI&#13;
p0cz8eZdfnq18q7csulob6hEtl2er/aR9TA6jAVeoyvLLWZtjN13L94To9c3lyjC3mrV0cz6PFus&#13;
rD6kExvS0ubAySqexAnZ3GFshRfKPpF8Fmp+WPeCO8qgU7T2pUAsdGPJuz4GBJPjDyDp+I4pXnff&#13;
6te1yqb3fBOT4QglTd3WWPQI79Ax9mWrmBeFmuc+yCMeDu2rrbrHs4XnEIHznMjHPGnBSRlSzsJW&#13;
T5t//lqDi+Qw7ngEJSocMFRljZ6uhTNhsD+Q7MbtbCf9TDH785PgfDIyGrGuX+vZ2BBvFue3SCC3&#13;
FrnAICF3Cfjz0Xx4/X8cUFDrhE9B/dz//v2BGUzmzkjiXsJRygntvFOdl+8klJw1ryGPPQARneWN&#13;
HPVvOsb0uLsRAwom9xvUcrbvDLPVVim5K4SZXgIHIP7uOs8zDl3c9GqoSl1R0I9PbInkUWIRnCid&#13;
/kTZQ/pgb4Ku0EE27P7ezV5qeA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns4:getMt102Request></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>RE3lmxMD2pZ6eWStDLMRq23wQWw=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
EuxAruxOe5OPWpe/IDxvFf7y8mA0Pa5Xty7MCgdxYlUPA/3Q8mzpFUEBH33gE3FCIrn7F+Ua5zox&#13;
qDh11LQEPxxNCXFCfH8tfQ/vTe74kF4jMLE0SUrj0h7f6P4uuHyJuFgrPmkelvVvx+GIf86tJVGf&#13;
mMdUHw5OtCkedpD57bO3F5+hvVSRtwyaZVYO+pAqACfen/bU5ABhnqFVCaDUhO3pbwCoTlYb/oJR&#13;
ONVQmcGqA5y7Fa437mwSagnAYOfKjZbQc6/8hzWoF1G5YV+vPn3bZx15sFBTSGMXZ88mq5aTYOVx&#13;
1P6i2nAlLQ6ZqaXEs+I+IzzhKXlv2RkSy0QyKA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>